org_posts/2013-05-17-setting-up-octopress-with-org-mode.org
#+OPTIONS: toc:nil num:nil
#+BEGIN_HTML
---
layout: post
title: "Setting up Octopress with Org-Mode"
date: 2013-05-17 11:36
comments: true
categories: Otopress, Emacs, LaTeX
---
#+END_HTML
* Introduction
[[http://octopress.org/][Octopress]] is an awesome static blog generator based on [[https://github.com/mojombo/jekyll][Jekyll]], which I
use for this site. Setting it up to work smoothly entirely from Emacs
(the most mind-blowing text editor in the world) with org-mode can be a bit
tricky. This is how I did it.
* Installing Octopress
Octopress has a nice [[http://octopress.org/docs/setup/][setup guide]], which you should follow. The only hurdle
I encountered, was setting up rbenv with homebrew under OS X. First,
install =rbenv=:
#+begin_src sh
  $ brew update
  $ brew install rbenv
  $ brew install ruby-build
#+end_src
Then install Ruby 1.9.3:
#+begin_src sh
  $ rbenv install 1.9.3-p194
  $ rbenv rehash
#+end_src
The tricky part is that you have to add =rbenv= to your path by appending
#+begin_src sh
  export PATH=~/.rbenv/shims:$PATH
  if which rbenv > /dev/null; then eval "$(rbenv init -)"; fi
#+end_src
to your =.zshrc= or =.bashrc=. Now check wether =ruby --version= is 1.9.3.

Finally, I installed the [[http://zespia.tw/Octopress-Theme-Slash/][Slash]] theme with no changes to the defaults.
