blog/2013-05-17-setting-up-octopress-with-org-mode.html

<!DOCTYPE HTML>
<html>
<head>
	<meta charset="utf-8">
	<title>Setting up Octopress with Org-Mode - Everything Counts</title>
	<meta name="author" content="Ronert Obst">

	
	<meta name="description" content="Introduction Octopress is an awesome static blog generator based on Jekyll, which I
use for this site. Setting it up to work smoothly entirely from &hellip;">
	
	<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

	<link href="/atom.xml" rel="alternate" title="Everything Counts" type="application/atom+xml">
	<link rel="canonical" href="">
	<link href="/favicon.png" rel="shortcut icon">
	<link href="/stylesheets/screen.css" media="screen, projection" rel="stylesheet" type="text/css">
	<!--[if lt IE 9]><![endif]-->
	
</head>

<body>
	<header id="header" class="inner"><h1><a href="/">Everything Counts</a></h1>
<nav id="main-nav"><ul class="main">
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Archives</a></li>
  <li><a href="/about/">About</a></li>
</ul>
</nav>
<nav id="mobile-nav">
	<div class="alignleft menu">
		<a class="button">Menu</a>
		<div class="container"><ul class="main">
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Archives</a></li>
  <li><a href="/about/">About</a></li>
</ul>
</div>
	</div>
	<div class="alignright search">
		<a class="button"></a>
		<div class="container">
			<form action="http://google.com/search" method="get">
				<input type="text" name="q" results="0">
				<input type="hidden" name="q" value="site:ronert-obst.com">
			</form>
		</div>
	</div>
</nav>
<nav id="sub-nav" class="alignright">
	<div class="social">
		
		<a class="facebook" href="http://www.facebook.com/ronert.obst" title="Facebook">Facebook</a>
		
		
		<a class="google" href="https://plus.google.com/102717496982395822694?rel=author" title="Google+">Google+</a>
		
		
		<a class="twitter" href="http://twitter.com/ronert_obst" title="Twitter">Twitter</a>
		
		
		<a class="github" href="https://github.com/ronert" title="GitHub">GitHub</a>
		
    
		
		
		
		
		
		<a class="rss" href="/atom.xml" title="RSS">RSS</a>
		
	</div>
	<form class="search" action="http://google.com/search" method="get">
		<input class="alignright" type="text" name="q" results="0">
		<input type="hidden" name="q" value="site:ronert-obst.com">
	</form>
</nav>

</header>
	
		
	
	<div id="content" class="inner"><article class="post">
	<h2 class="title">Setting Up Octopress With Org-Mode</h2>
	<div class="entry-content"><div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Introduction</h2>
<div class="outline-text-2" id="text-1">

<p><a href="http://octopress.org/">Octopress</a> is an awesome static blog generator based on <a href="https://github.com/mojombo/jekyll">Jekyll</a>, which I
use for this site. Setting it up to work smoothly entirely from Emacs
(the most mind-blowing text editor in the world) with org-mode can be a bit
tricky. This is how I did it.
</p></div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Installing Octopress</h2>
<div class="outline-text-2" id="text-2">

<p>Octopress has a nice <a href="http://octopress.org/docs/setup/">setup guide</a>, which you should follow. The only hurdle
I encountered, was setting up rbenv with homebrew under OS X. First,
install <code>rbenv</code>:

<div class="bogus-wrapper"><notextile><figure class="code"> <div class="highlight"><table><tr><td class="gutter"><pre class="line-numbers"><span class="line-number">1</span>
<span class="line-number">2</span>
<span class="line-number">3</span>
</pre></td><td class="code"><pre><code class="sh"><span class="line">  <span class="nv">$ </span>brew update
</span><span class="line">  <span class="nv">$ </span>brew install rbenv
</span><span class="line">  <span class="nv">$ </span>brew install ruby-build
</span></code></pre></td></tr></table></div></figure></notextile></div>

Then install Ruby 1.9.3:

<div class="bogus-wrapper"><notextile><figure class="code"> <div class="highlight"><table><tr><td class="gutter"><pre class="line-numbers"><span class="line-number">1</span>
<span class="line-number">2</span>
</pre></td><td class="code"><pre><code class="sh"><span class="line">  <span class="nv">$ </span>rbenv install 1.9.3-p194
</span><span class="line">  <span class="nv">$ </span>rbenv rehash
</span></code></pre></td></tr></table></div></figure></notextile></div>

The tricky part is that you have to add <code>rbenv</code> to your path by appending

<div class="bogus-wrapper"><notextile><figure class="code"> <div class="highlight"><table><tr><td class="gutter"><pre class="line-numbers"><span class="line-number">1</span>
<span class="line-number">2</span>
</pre></td><td class="code"><pre><code class="sh"><span class="line">  <span class="nb">export </span><span class="nv">PATH</span><span class="o">=</span>~/.rbenv/shims:<span class="nv">$PATH</span>
</span><span class="line">  <span class="k">if </span>which rbenv &gt; /dev/null; <span class="k">then </span><span class="nb">eval</span> <span class="s2">&quot;$(rbenv init -)&quot;</span>; <span class="k">fi</span>
</span></code></pre></td></tr></table></div></figure></notextile></div>

to your <code>.zshrc</code> or <code>.bashrc</code>. Now check wether <code>ruby --version</code> is 1.9.3.
</p>
<p>
Finally, I installed the <a href="http://zespia.tw/Octopress-Theme-Slash/">Slash</a> theme with no changes to the defaults.
</p></div>

</div>
