org_posts/2013-05-17-setting-up-octopress-with-org-mode.org
* Configuring Org-Mode
Now it is time to configure org-mode for exporting to
Octopress. Install the [[https://github.com/craftkiller/orgmode-octopress][org-mode octopress exporter]] and follow the
instructions from [[http://blog.paphus.com/blog/2012/08/01/introducing-octopress-blogging-for-org-mode/][here]]. But we are not done yet, the workflow is still
far too cumbersum: You need to move posts manually and open them im
org-mode. That is not the true Emacs style! Luckily, Xu Zhiqiang
made some [[http://blog.xeonxu.info/blog/2012/09/05/you-hua-shi-yong-orgmodefa-bu-octopressde-fang-fa/][modifications]] to automate this workflow. Edit the Rakefile, adding
an editor variable:
#+begin_src ruby
 deploy_dir      = "_deploy"   # deploy directory (for Github pages deployment)
 stash_dir       = "_stash"    # directory to stash posts for speedy generation
 posts_dir       = "_posts"    # directory for blog files
 org_posts_dir   = "org_posts"
 themes_dir      = ".themes"   # directory for blog files
 new_post_ext    = "org"  # default new post file extension when using the new_post task
 new_page_ext    = "markdown"  # default new page file extension when using the new_page task
 server_port     = "4000"      # port for preview server eg. localhost:4000

 editor ="~/bin/em" # Emacs wrapper
#+end_src
and make a script in your path like so:
#+begin_src sh
  #!/bin/bash
  /Applications/Emacs.app/Contents/MacOS/bin/emacsclient -n -a "/Applications/Emacs.app/Contents/MacOS/Emacs" $1 > /dev/null 2>&1 &
#+end_src
Make the following modifications to your Rakefile, so Octopress
recognizes your =org_posts_dir=. In the =task :install, :theme
do |t, args|= statement add the =org_posts_dir= statement.
#+begin_src ruby
  theme = args.theme || 'classic'
  puts "## Copying "+theme+" theme into ./#{source_dir} and ./sass"
  mkdir_p source_dir
  cp_r "#{themes_dir}/#{theme}/source/.", source_dir
  mkdir_p "sass"
  cp_r "#{themes_dir}/#{theme}/sass/.", "sass"
  mkdir_p "#{source_dir}/#{posts_dir}"
  mkdir_p "#{source_dir}/#{org_posts_dir}"
  mkdir_p public_dir
#+end_src
In the =task :new_post, :title do |t, args|= also insert =org_posts_dir=
#+begin_src ruby
task :new_post, :title do |t, args|
   raise "### You haven't set anything up yet. First run `rake install` to set up an Octopress theme." unless File.directory?(source_dir)
   mkdir_p "#{source_dir}/#{posts_dir}"
   mkdir_p "#{source_dir}/#{org_posts_dir}"
   args.with_defaults(:title => 'new-post')
   title = args.title
   filename = "#{source_dir}/#{org_posts_dir}/#{Time.now.strftime('%Y-%m-%d')}-#{title.to_url}.#{new_post_ext}"
   if File.exist?(filename)
     abort("rake aborted!") if ask("#{filename} already exists. Do you want to overwrite?", ['y', 'n']) == 'n'
   end
#+end_src
In order to open up Emacs and visit a new post immediately after creating it, we need to add the following editing statement to =new_post=:
#+begin_src ruby
desc "Begin a new post in #{source_dir}/#{org_posts_dir}"
task :new_post, :title do |t, args|
  raise "### You haven't set anything up yet. First run `rake install` to set up an Octopress theme." unless File.directory?(source_dir)
  mkdir_p "#{source_dir}/#{posts_dir}"
  mkdir_p "#{source_dir}/#{org_posts_dir}"
  args.with_defaults(:title => 'new-post')
  title = args.title
  filename = "#{source_dir}/#{org_posts_dir}/#{Time.now.strftime('%Y-%m-%d')}-#{title.to_url}.#{new_post_ext}"
  if File.exist?(filename)
    abort("rake aborted!") if ask("#{filename} already exists. Do you want to overwrite?", ['y', 'n']) == 'n'
  end
  puts "Creating new post: #{filename}"
  open(filename, 'w') do |post|
    post.puts "#+BEGIN_HTML"
    post.puts "---"
    post.puts "layout: post"
    post.puts "title: \"#{title.gsub(/&/,'&amp;')}\""
    post.puts "date: #{Time.now.strftime('%Y-%m-%d %H:%M')}"
    post.puts "comments: true"
    post.puts "categories: "
    post.puts "---"
    post.puts "#+END_HTML"
  end
  if #{editor}
    system "sleep 1; #{editor} #{filename}"
  end
end
#+end_src
Add the same editing statement to =new_page=:
#+begin_src ruby
  if  # {editor}
    system  "sleep 1; # { editor }  # { file } "
  end
#+end_src
The wise Xu Zhiqiang adds a statement to automatically open a new browser tab at =http://localhost:4000= when you =rake preview= your blog. Append this to the =preview= command in the Rakefile:
#+begin_src ruby
 system "sleep 2; open http://localhost:#{server_port}/"
   [jekyllPid, compassPid, rackupPid].each { |pid| Process.wait(pid) }
#+end_src
Now you can run =rake new post["title"]= and an =.org= file is created
in the =org_posts_dir= which then opens in Emacs. Once you finish
editing it, just run =M-x save-then-publish= and close the frame with
=C-x 5 0=. When you run =rake generate && rake preview=, a browser tab
opens with your new post. Nice!
